In [1]:
from sqlalchemy import create_engine, Column, Integer, String, Float
from sqlalchemy.orm import declarative_base
from sqlalchemy.orm import sessionmaker
import pandas as pd

In [2]:
import os 
filename = "student_database_part2.db"
current_directory = os.getcwd()
file_path = os.path.join(current_directory, filename)

if os.path.exists(file_path):
    try: 
        os.remove(file_path)
        print(f"file got deleted")
    except Exception as error:
        print(f"An error {error} occured while deleting the file")
else: 
    print("File was not there")
print(f"{file_path}")

File was not there
C:\Users\Dhruva\Desktop\temp-assignment_12\student_database_part2.db

In [4]:
engine = create_engine('sqlite:///student_database_part2.db', echo = True)
Base = declarative_base()

In [5]:
class Student(Base):
    __tablename__ = "student_marks"
    stud_id = Column(Integer, primary_key = True)
    stud_name = Column(String, nullable = False)
    sub_name = Column(String, nullable = False)
    marks = Column(Integer, nullable = False)

In [28]:
def create_table():
    Base.metadata.create_all(engine)
    print("Table has been created successfully. ")

def insert_data(data):
    Session = sessionmaker(bind = engine)
    session = Session()

    session.add_all(data)
    session.commit()
    session.close()
    print("Sample Data Inserted successfully.")

def read_data():
    df = pd.read_sql('student_marks', con = engine)
    return df

def update_marks(df, stud_id, new_marks):
    df.loc[df['stud_id'] == stud_id, 'marks'] = new_marks
    return df
    
def write_data(df):
    df.to_sql('student_marks', con = engine, if_exists = 'replace', index = False)
    print('Updated data has been written back to the database')

In [9]:

create_table()

2024-09-15 11:23:31,731 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-09-15 11:23:31,733 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:23:31,734 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:23:31,745 INFO sqlalchemy.engine.Engine COMMIT
Table has been created successfully.

In [10]:
data = [
    Student(stud_id = 1, stud_name = 'Jhin', sub_name = "Maths", marks = 44),
    Student(stud_id = 2, stud_name = 'Viego', sub_name = 'Poetry', marks = 43),
    Student(stud_id = 3, stud_name = 'Jayce', sub_name = 'Electronics', marks = 48),
    Student(stud_id = 4, stud_name = 'Son-Uzal', sub_name = 'Politics', marks = 50),
]

insert_data(data)

2024-09-15 11:23:38,108 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-09-15 11:23:38,116 INFO sqlalchemy.engine.Engine INSERT INTO student_marks (stud_id, stud_name, sub_name, marks) VALUES (?, ?, ?, ?)
2024-09-15 11:23:38,119 INFO sqlalchemy.engine.Engine [generated in 0.00361s] [(1, 'Jhin', 'Maths', 44), (2, 'Viego', 'Poetry', 43), (3, 'Jayce', 'Electronics', 48), (4, 'Son-Uzal', 'Politics', 50)]
2024-09-15 11:23:38,127 INFO sqlalchemy.engine.Engine COMMIT
Sample Data Inserted successfully.

In [29]:
df = read_data()
df

2024-09-15 11:54:47,485 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-09-15 11:54:47,487 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:54:47,489 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,490 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-09-15 11:54:47,490 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,497 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-09-15 11:54:47,499 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,502 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("student_marks")
2024-09-15 11:54:47,506 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,509 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-09-15 11:54:47,511 INFO sqlalchemy.engine.Engine [raw sql] ('student_marks',)
2024-09-15 11:54:47,515 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("student_marks")
2024-09-15 11:54:47,517 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,520 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("student_marks")
2024-09-15 11:54:47,523 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,526 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-09-15 11:54:47,528 INFO sqlalchemy.engine.Engine [raw sql] ('student_marks',)
2024-09-15 11:54:47,531 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("student_marks")
2024-09-15 11:54:47,533 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,535 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("student_marks")
2024-09-15 11:54:47,536 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,539 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:54:47,540 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,544 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("student_marks")
2024-09-15 11:54:47,545 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,548 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("student_marks")
2024-09-15 11:54:47,549 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,554 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:54:47,556 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:54:47,559 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-09-15 11:54:47,562 INFO sqlalchemy.engine.Engine [raw sql] ('student_marks',)
2024-09-15 11:54:47,567 INFO sqlalchemy.engine.Engine SELECT student_marks.stud_id, student_marks.stud_name, student_marks.sub_name, student_marks.marks
FROM student_marks
2024-09-15 11:54:47,569 INFO sqlalchemy.engine.Engine [generated in 0.00218s] ()
2024-09-15 11:54:47,578 INFO sqlalchemy.engine.Engine ROLLBACK

   stud_id stud_name     sub_name  marks
0        1      Jhin        Maths     44
1        2     Viego       Poetry     43
2        3     Jayce  Electronics     48
3        4  Son-Uzal     Politics     50

In [30]:
new_df = update_marks(df, stud_id = 2, new_marks = 47)
new_df

   stud_id stud_name     sub_name  marks
0        1      Jhin        Maths     44
1        2     Viego       Poetry     47
2        3     Jayce  Electronics     48
3        4  Son-Uzal     Politics     50

In [31]:
write_data(new_df)

2024-09-15 11:55:12,637 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-09-15 11:55:12,649 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:55:12,654 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,657 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:55:12,659 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,662 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-09-15 11:55:12,664 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,668 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-09-15 11:55:12,670 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,673 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("student_marks")
2024-09-15 11:55:12,675 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,678 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-09-15 11:55:12,680 INFO sqlalchemy.engine.Engine [raw sql] ('student_marks',)
2024-09-15 11:55:12,684 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("student_marks")
2024-09-15 11:55:12,686 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,690 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("student_marks")
2024-09-15 11:55:12,692 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,694 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-09-15 11:55:12,697 INFO sqlalchemy.engine.Engine [raw sql] ('student_marks',)
2024-09-15 11:55:12,701 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("student_marks")
2024-09-15 11:55:12,703 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,708 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("student_marks")
2024-09-15 11:55:12,711 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,717 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:55:12,719 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,724 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("student_marks")
2024-09-15 11:55:12,732 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,736 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("student_marks")
2024-09-15 11:55:12,737 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,739 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:55:12,741 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:12,744 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-09-15 11:55:12,746 INFO sqlalchemy.engine.Engine [raw sql] ('student_marks',)
2024-09-15 11:55:12,753 INFO sqlalchemy.engine.Engine
DROP TABLE student_marks
2024-09-15 11:55:12,755 INFO sqlalchemy.engine.Engine [no key 0.00170s] ()
2024-09-15 11:55:12,770 INFO sqlalchemy.engine.Engine
CREATE TABLE student_marks (
	stud_id BIGINT,
	stud_name TEXT,
	sub_name TEXT,
	marks BIGINT
)


2024-09-15 11:55:12,772 INFO sqlalchemy.engine.Engine [no key 0.00159s] ()
2024-09-15 11:55:12,788 INFO sqlalchemy.engine.Engine INSERT INTO student_marks (stud_id, stud_name, sub_name, marks) VALUES (?, ?, ?, ?)
2024-09-15 11:55:12,789 INFO sqlalchemy.engine.Engine [generated in 0.00169s] [(1, 'Jhin', 'Maths', 44), (2, 'Viego', 'Poetry', 47), (3, 'Jayce', 'Electronics', 48), (4, 'Son-Uzal', 'Politics', 50)]
2024-09-15 11:55:12,794 INFO sqlalchemy.engine.Engine COMMIT
Updated data has been written back to the database

In [32]:
read_data()

2024-09-15 11:55:26,953 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-09-15 11:55:26,955 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:55:26,960 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:26,965 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-09-15 11:55:26,967 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:26,970 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2024-09-15 11:55:26,972 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:26,975 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("student_marks")
2024-09-15 11:55:26,977 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:26,980 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-09-15 11:55:26,981 INFO sqlalchemy.engine.Engine [raw sql] ('student_marks',)
2024-09-15 11:55:26,985 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("student_marks")
2024-09-15 11:55:26,987 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:26,989 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("student_marks")
2024-09-15 11:55:26,991 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:26,994 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-09-15 11:55:26,996 INFO sqlalchemy.engine.Engine [raw sql] ('student_marks',)
2024-09-15 11:55:26,998 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("student_marks")
2024-09-15 11:55:27,000 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:27,003 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("student_marks")
2024-09-15 11:55:27,004 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:27,007 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:55:27,009 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:27,011 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("student_marks")
2024-09-15 11:55:27,013 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:27,018 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("student_marks")
2024-09-15 11:55:27,019 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:27,022 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("student_marks")
2024-09-15 11:55:27,025 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-09-15 11:55:27,028 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2024-09-15 11:55:27,029 INFO sqlalchemy.engine.Engine [raw sql] ('student_marks',)
2024-09-15 11:55:27,035 INFO sqlalchemy.engine.Engine SELECT student_marks.stud_id, student_marks.stud_name, student_marks.sub_name, student_marks.marks
FROM student_marks
2024-09-15 11:55:27,036 INFO sqlalchemy.engine.Engine [generated in 0.00141s] ()
2024-09-15 11:55:27,043 INFO sqlalchemy.engine.Engine ROLLBACK

   stud_id stud_name     sub_name  marks
0        1      Jhin        Maths     44
1        2     Viego       Poetry     47
2        3     Jayce  Electronics     48
3        4  Son-Uzal     Politics     50